[
  {
    "id": 1,
    "year": "Бронзовый век",
    "title": "Начало традиций",
    "titleKk": "Дәстүрлердің бастауы",
    "titleEn": "Beginning of traditions",
    "description": "Первые свидетельства использования лука и стрел на территории Казахстана датируются бронзовым веком. Наши предки были искусными лучниками.",
    "descriptionKk": "Қазақстан территориясында садақ пен жебені пайдаланудың алғашқы дәлелдері қола дәуірінен басталады. Біздің бабаларымыз шебер садақшылар болған.",
    "descriptionEn": "The first evidence of the use of bow and arrows in Kazakhstan dates back to the Bronze Age. Our ancestors were skilled archers.",
    "iconType": "scroll",
    "sortOrder": 1,
    "isActive": true,
    "createdAt": "2025-12-22T11:56:32.144Z",
    "updatedAt": "2025-12-22T11:59:19.509Z"
  },
  {
    "id": 2,
    "year": "1992",
    "title": "Основание федерации",
    "titleKk": "Федерацияның құрылуы",
    "titleEn": "Federation founding",
    "description": "После обретения независимости была официально создана Федерация стрельбы из лука Республики Казахстан.",
    "descriptionKk": "Тәуелсіздік алғаннан кейін Қазақстан Республикасының садақ атудан федерациясы ресми түрде құрылды.",
    "descriptionEn": "After gaining independence, the Archery Federation of the Republic of Kazakhstan was officially established.",
    "iconType": "calendar",
    "sortOrder": 2,
    "isActive": true,
    "createdAt": "2025-12-22T11:56:32.151Z",
    "updatedAt": "2025-12-22T11:59:19.515Z"
  },
  {
    "id": 3,
    "year": "1996",
    "title": "Первые международные успехи",
    "titleKk": "Алғашқы халықаралық жетістіктер",
    "titleEn": "First international successes",
    "description": "Казахстанские лучники впервые приняли участие в Олимпийских играх в Атланте и показали достойные результаты.",
    "descriptionKk": "Қазақстандық садақшылар алғаш рет Атлантадағы Олимпиада ойындарына қатысып, лайықты нәтижелер көрсетті.",
    "descriptionEn": "Kazakh archers participated in the Olympic Games in Atlanta for the first time and showed worthy results.",
    "iconType": "trophy",
    "sortOrder": 3,
    "isActive": true,
    "createdAt": "2025-12-22T11:56:32.154Z",
    "updatedAt": "2025-12-22T11:59:19.518Z"
  },
  {
    "id": 4,
    "year": "2004",
    "title": "Развитие инфраструктуры",
    "titleKk": "Инфрақұрылымның дамуы",
    "titleEn": "Infrastructure development",
    "description": "Открытие современных тренировочных центров в Алматы и Астане. Начало системной подготовки молодых спортсменов.",
    "descriptionKk": "Алматы мен Астанада заманауи жаттығу орталықтарының ашылуы. Жас спортшыларды жүйелі даярлаудың басталуы.",
    "descriptionEn": "Opening of modern training centers in Almaty and Astana. Beginning of systematic training for young athletes.",
    "iconType": "target",
    "sortOrder": 4,
    "isActive": true,
    "createdAt": "2025-12-22T11:56:32.159Z",
    "updatedAt": "2025-12-22T11:59:19.520Z"
  },
  {
    "id": 5,
    "year": "2023-2024",
    "title": "Новая эра",
    "titleKk": "Жаңа дәуір",
    "titleEn": "New era",
    "description": "Активное развитие федерации: участие в международных соревнованиях, подготовка к Олимпиаде 2028, рост числа спортсменов.",
    "descriptionKk": "Федерацияның белсенді дамуы: халықаралық жарыстарға қатысу, 2028 Олимпиадасына дайындық, спортшылар санының өсуі.",
    "descriptionEn": "Active development of the federation: participation in international competitions, preparation for the 2028 Olympics, growing number of athletes.",
    "iconType": "medal",
    "sortOrder": 5,
    "isActive": true,
    "createdAt": "2025-12-22T11:56:32.163Z",
    "updatedAt": "2025-12-22T11:59:19.521Z"
  }
]